@c version 1.23
@menu
* Funciones y variables para Constantes::   
@end menu

@node Funciones y variables para Constantes,  , Constantes, Constantes
@section Funciones y variables para Constantes

@defvr {Constante} %e
@ifinfo
@vrindex e
@vrindex N@'umero de Euler
@vrindex Base de los logaritmos naturales
@end ifinfo
El s@'{@dotless{i}}mbolo @code{%e} representa a la base de los logaritmos
naturales, tambi@'en conocido como n@'umero de Euler. El valor num@'erico
de @code{%e} es el n@'umero decimal en coma flotante 2.718281828459045d0.

@end defvr


@defvr {Constante} %i
@ifinfo
@vrindex i
@vrindex Unidad imaginaria
@end ifinfo
El s@'{@dotless{i}}mbolo @code{%i} representa la unidad imaginaria, @math{sqrt(- 1)}.

@end defvr


@defvr {Constante} false
El s@'{@dotless{i}}mbolo @code{false} representa al valor l@'ogico
"falso". Maxima implementa @code{false} con el valor @code{NIL} de
Lisp.
@end defvr

@defvr {Constante} ind
@ifinfo
@vrindex Indeterminado
@end ifinfo

@code{ind} representa un resultado acotado indeterminado.

V@'ease tambi@'en @code{limit}.

Ejemplo:

@c ===beg===
@c limit (sin(1/x), x, 0);
@c ===end===
@example
(%i1) limit (sin(1/x), x, 0);
(%o1)                          ind
@end example
@end defvr

@defvr {Constante} inf
@ifinfo
@vrindex M@'as infinito
@end ifinfo
El s@'{@dotless{i}}mbolo @code{inf} representa al infinito real positivo.
@end defvr

@defvr {Constante}  infinity
@ifinfo
@vrindex Infinito complejo
@end ifinfo
El s@'{@dotless{i}}mbolo @code{infinity} representa al infinito complejo.
@end defvr

@defvr {Constante} minf
@ifinfo
@vrindex Menos infinito
@vrindex Infinito negativo
@end ifinfo
El s@'{@dotless{i}}mbolo @code{minf} representa al infinito real negativo.
@end defvr

@defvr {Constante} %phi
@ifinfo
@vrindex phi
@vrindex Raz@'on @'aurea
@end ifinfo

El s@'{@dotless{i}}mbolo @code{%phi} representa a la llamada @i{raz@'on @'aurea},
@math{(1 + sqrt(5))/2}.
El valor num@'erico de @code{%phi} es el n@'umero decimal en coma flotante 1.618033988749895d0.

La funci@'on @code{fibtophi} expresa los n@'umeros de Fibonacci @code{fib(n)} en
t@'erminos de @code{%phi}.

Por defecto, Maxima desconoce las propiedades algebraicas de @code{%phi}.
Tras evaluar @code{tellrat(%phi^2 - %phi - 1)} y @code{algebraic: true},
@code{ratsimp} puede simplificar algunas expresiones que contengan @code{%phi}.

Ejemplos:

@code{fibtophi} expresa el n@'umero de Fibonacci @code{fib(n)} en t@'erminos de @code{%phi}.

@c ===beg===
@c fibtophi (fib (n));
@c fib (n-1) + fib (n) - fib (n+1);
@c fibtophi (%);
@c ratsimp (%);
@c ===end===
@example
(%i1) fibtophi (fib (n));
                           n             n
                       %phi  - (1 - %phi)
(%o1)                  -------------------
                           2 %phi - 1
(%i2) fib (n-1) + fib (n) - fib (n+1);
(%o2)          - fib(n + 1) + fib(n) + fib(n - 1)
(%i3) fibtophi (%);
            n + 1             n + 1       n             n
        %phi      - (1 - %phi)        %phi  - (1 - %phi)
(%o3) - --------------------------- + -------------------
                2 %phi - 1                2 %phi - 1
                                          n - 1             n - 1
                                      %phi      - (1 - %phi)
                                    + ---------------------------
                                              2 %phi - 1
(%i4) ratsimp (%);
(%o4)                           0
@end example

Por defecto, Maxima desconoce las propiedades algebraicas de @code{%phi}.
Despu@'es de evaluar @code{tellrat (%phi^2 - %phi - 1)} y
@code{algebraic: true}, @code{ratsimp} puede simplificar algunas expresiones
que contengan @code{%phi}.


@c ===beg===
@c e : expand ((%phi^2 - %phi - 1) * (A + 1));
@c ratsimp (e);
@c tellrat (%phi^2 - %phi - 1);
@c algebraic : true;
@c ratsimp (e);
@c ===end===
@example
(%i1) e : expand ((%phi^2 - %phi - 1) * (A + 1));
                 2                      2
(%o1)        %phi  A - %phi A - A + %phi  - %phi - 1
(%i2) ratsimp (e);
                  2                     2
(%o2)        (%phi  - %phi - 1) A + %phi  - %phi - 1
(%i3) tellrat (%phi^2 - %phi - 1);
                            2
(%o3)                  [%phi  - %phi - 1]
(%i4) algebraic : true;
(%o4)                         true
(%i5) ratsimp (e);
(%o5)                           0
@end example

@end defvr


@defvr {Constante} %pi
@ifinfo
@vrindex pi
@end ifinfo
El s@'{@dotless{i}}mbolo @code{%pi} representa la raz@'on entre la longitud de
una circunferencia y su radio. 
El valor num@'erico de @code{%pi} es el n@'umero decimal en coma flotante 3.141592653589793d0.
@end defvr

@defvr {Constante} true
El s@'{@dotless{i}}mbolo @code{true} representa al valor l@'ogico
"verdadero". Maxima implementa @code{true} con el valor @code{T} de
Lisp.
@end defvr

@defvr {Constante} und
@ifinfo
@vrindex Indefinido
@end ifinfo

@code{und} representa un resultado indefinido.

V@'ease tambi@'en @code{limit}.

Ejemplo:

@c ===beg===
@c limit (1/x, x, 0);
@c ===end===
@example
(%i1) limit (1/x, x, 0);
(%o1)                          und
@end example
@end defvr

@defvr {Constante} zeroa
@code{zeroa} representa un infinitesimal mayor que cero. 
@code{zeroa} puede utilizarse en expresiones. @code{limit}
simplifica expresiones que contienen infinitesimales.

V@'eanse tambi@'en @code{zerob} y @code{limit}.

Ejemplo:

@code{limit} simplifica expresiones que contienen infinitesimales:

@c ===beg===
@c limit(zeroa);
@c limit(zeroa+x);
@c ===end===
@example
(%i1) limit(zeroa);
(%o1)                                  0
(%i2) limit(x+zeroa);
(%o2)                                  x
@end example

@end defvr

@defvr {Constante} zerob
@code{zerob} representa un infinitesimal menor que cero. 
@code{zerob} puede utilizarse en expresiones. @code{limit}
simplifica expresiones que contienen infinitesimales.

V@'eanse tambi@'en @code{zeroa} y @code{limit}.
@end defvr

