@c english version 1.6
@menu
* Funciones y variables para f90::
@end menu

@node Funciones y variables para f90,  , f90, f90
@section Funciones y variables para f90


@deffn {Funci@'on} f90 (@var{expr_1}, ..., @var{expr_n})

Imprime una o m@'as expresiones @var{expr_1}, ..., @var{expr_n}
como un programa Fortran 90. El programa se obtiene a trav@'es de
la salida est@'andar.

La funci@'on @code{f90} imprime su salida en el llamado formato libre de
Fortran 90: no se presta atenci@'on alguna a las posiciones de caracteres
respecto de las columnas y los renglones largos se dividen a un ancho fijo con el
car@'acter @code{&} indicando continuaci@'on de c@'odigo.

Ejec@'utese @code{load(f90)} antes de utilizar esta funci@'on.

Ejemplos:

@c ===beg===
@c load (f90)$
@c foo : expand ((xxx + yyy + 7)^4);
@c f90 ('foo = foo);
@c ===end===
@example
(%i1) load (f90)$
(%i2) foo : expand ((xxx + yyy + 7)^4);
         4            3         3        2    2             2
(%o2) yyy  + 4 xxx yyy  + 28 yyy  + 6 xxx  yyy  + 84 xxx yyy
          2        3             2
 + 294 yyy  + 4 xxx  yyy + 84 xxx  yyy + 588 xxx yyy + 1372 yyy
      4         3          2
 + xxx  + 28 xxx  + 294 xxx  + 1372 xxx + 2401
(%i3) f90 ('foo = foo);
foo = yyy**4+4*xxx*yyy**3+28*yyy**3+6*xxx**2*yyy**2+84*xxx*yyy**2&
+294*yyy**2+4*xxx**3*yyy+84*xxx**2*yyy+588*xxx*yyy+1372*yyy+xxx**&
4+28*xxx**3+294*xxx**2+1372*xxx+2401
(%o3)                         false
@end example

Expresiones m@'ultiples. Captura de la salida est@'andar a un fichero
por medio de la funci@'on @code{with_stdout}.

@c ===beg===
@c load (f90)$
@c foo : sin (3*x + 1) - cos (7*x - 2);
@c with_stdout ("foo.f90", f90 (x = 0.25, y = 0.625, 'foo = foo, 'stop, 'end));
@c printfile ("foo.f90");
@c ===end===
@example
(%i1) load (f90)$
(%i2) foo : sin (3*x + 1) - cos (7*x - 2);
(%o2)              sin(3 x + 1) - cos(7 x - 2)
(%i3) with_stdout ("foo.f90", f90 (x = 0.25, y = 0.625, 'foo = foo, 'stop, 'end));
(%o3)                         false
(%i4) printfile ("foo.f90");
x = 0.25
y = 0.625
foo = sin(3*x+1)-cos(7*x-2)
stop
end
(%o4)                        foo.f90
@end example
@end deffn

