@c Language: Brazilian Portuguese, Encoding: iso-8859-1
@c /Groups.texi/1.12/Sat Jun  2 00:12:46 2007/-ko/
@menu
* Fun@value{cedilha}@~{o}es e Vari@'{a}veis Definidas para Grupos::
@end menu

@node Fun@value{cedilha}@~{o}es e Vari@'{a}veis Definidas para Grupos,  , Grupos, Grupos
@section Fun@value{cedilha}@~{o}es e Vari@'{a}veis Definidas para Grupos

@deffn {Fun@value{cedilha}@~{a}o} todd_coxeter (@var{rela@value{cedilha}@~{a}o}, @var{subgroupo})
@deffnx {Fun@value{cedilha}@~{a}o} todd_coxeter (@var{rela@value{cedilha}@~{a}o})

Acha a ordem de G/H onde G @'{e} o m@'{o}dulo do Grupo Livre @var{rela@value{cedilha}@~{a}o}, e
H @'{e} o subgroupo de G gerado por @var{subgroupo}.  @var{subgroupo} @'{e} um argumento
opcional, cujo valor padr@~{a}o @'{e} [].  Em fazendo isso a fun@value{cedilha}@~{a}o produz uma
tabela de multiplica@value{cedilha}@~{a}o @`a direita de G sobre G/H, onde os
co-conjuntos s@~{a}o enumerados [H,Hg2,Hg3,...].  Isso pode ser visto internamente no
@code{todd_coxeter_state}.

Exemplo:

@c ===beg===
@c symet(n):=create_list(
@c         if (j - i) = 1 then (p(i,j))^^3 else
@c             if (not i = j) then (p(i,j))^^2 else
@c                 p(i,i) , j, 1, n-1, i, 1, j);
@c p(i,j) := concat(x,i).concat(x,j);
@c symet(5);
@c todd_coxeter(%o3);
@c todd_coxeter(%o3,[x1]);
@c todd_coxeter(%o3,[x1,x2]);
@c ===end===
@example
(%i1) symet(n):=create_list(
        if (j - i) = 1 then (p(i,j))^^3 else
            if (not i = j) then (p(i,j))^^2 else
                p(i,i) , j, 1, n-1, i, 1, j);
                                                       <3>
(%o1) symet(n) := create_list(if j - i = 1 then p(i, j)

                                <2>
 else (if not i = j then p(i, j)    else p(i, i)), j, 1, n - 1, 

i, 1, j)
(%i2) p(i,j) := concat(x,i).concat(x,j);
(%o2)        p(i, j) := concat(x, i) . concat(x, j)
(%i3) symet(5);
         <2>           <3>    <2>           <2>           <3>
(%o3) [x1   , (x1 . x2)   , x2   , (x1 . x3)   , (x2 . x3)   , 

            <2>           <2>           <2>           <3>    <2>
          x3   , (x1 . x4)   , (x2 . x4)   , (x3 . x4)   , x4   ]
(%i4) todd_coxeter(%o3);

Rows tried 426
(%o4)                          120
(%i5) todd_coxeter(%o3,[x1]);

Rows tried 213
(%o5)                          60
(%i6) todd_coxeter(%o3,[x1,x2]);

Rows tried 71
(%o6)                          20
@end example

@end deffn

