@c Language: Brazilian Portuguese, Encoding: iso-8859-1
@c /mnewton.texi/1.3/Sat Jun  2 00:13:25 2007//
@menu
* Fun@value{cedilha}@~{o}es e Vari@'{a}veis Definidas para mnewton::
@end menu


@node Fun@value{cedilha}@~{o}es e Vari@'{a}veis Definidas para mnewton,  , mnewton, mnewton
@section Fun@value{cedilha}@~{o}es e Vari@'{a}veis Definidas para mnewton

@defvr {Vari@'{a}vel de op@value{cedilha}@~{a}o} newtonepsilon
Valor padr@~{a}o: @code{10.0^(-fpprec/2)}

Precis@~{a}o para determinar quando a fun@value{cedilha}@~{a}o @code{mnewton} convergiu em dire@value{cedilha}@~{a}o @`a solu@value{cedilha}@~{a}o.

Veja tamb@'{e}m @code{mnewton}.
@end defvr


@defvr {Vari@'{a}vel de op@value{cedilha}@~{a}o} newtonmaxiter
Valor padr@~{a}o: @code{50}

N@'{u}mero m@'{a}ximo de itera@value{cedilha}@~{o}es que para a fun@value{cedilha}@~{a}o @code{mnewton}
caso essa fun@value{cedilha}@~{a}o n@~{a}o seja convergente ou se convergir muito lentamente.

Veja tamb@'{e}m @code{mnewton}.
@end defvr


@deffn {Fun@value{cedilha}@~{a}o} mnewton (@var{FuncList},@var{VarList},@var{GuessList})
Solu@value{cedilha}@~{a}o de multiplas fun@value{cedilha}@~{o}es n@~{a}o lineares usando o m@'{e}todo de Newton.
@var{FuncList} @'{e} a lista de fun@value{cedilha}@~{o}es a serem resolvidas,
@var{VarList} @'{e} a lista dos nomes de vari@'{a}veis, e
@var{GuessList} @'{e} a lista de aproxima@value{cedilha}@~{o}es iniciais.

A solu@value{cedilha}@~{a}o @'{e} retornada no mesmo formato retornado pela fun@value{cedilha}@~{a}o @code{solve()}.
Caso a solu@value{cedilha}@~{a}o n@~{a}o seja encontrada, @code{[]} @'{e} retornado.

Essa fun@value{cedilha}@~{a}o @'{e} controlada atrav@'{e}s das vari@'{a}veis globais @code{newtonepsilon} e @code{newtonmaxiter}.

@example
(%i1) load("mnewton")$

(%i2) mnewton([x1+3*log(x1)-x2^2, 2*x1^2-x1*x2-5*x1+1],
              [x1, x2], [5, 5]);
(%o2) [[x1 = 3.756834008012769, x2 = 2.779849592817897]]
(%i3) mnewton([2*a^a-5],[a],[1]);
(%o3)             [[a = 1.70927556786144]]
(%i4) mnewton([2*3^u-v/u-5, u+2^v-4], [u, v], [2, 2]);
(%o4) [[u = 1.066618389595407, v = 1.552564766841786]]
@end example

Para usar essa fun@value{cedilha}@~{a}o primeiro escreva @code{load("mnewton")}. Veja tamb@'{e}m @code{newtonepsilon} e @code{newtonmaxiter}.
@end deffn

