@c /Contexts.texi/1.12/Thu Feb  9 00:55:29 2006/-ko/
@c end concepts Contexts
@menu
* Defini@value{cedilha}@~oes para Contextos::    
@end menu

@node Defini@value{cedilha}@~oes para Contextos,  , Contextos, Contextos
@section Defini@value{cedilha}@~oes para Contextos

@deffn {Fun@value{cedilha}@~ao} activate (@var{context_1}, ..., @var{context_n})
Ativa os contextos @var{context_1}, ..., @var{context_n}.
Os factos nesses contextos est@~ao ent@~ao dispon@'{@dotless{i}}veis para
fazer dedu@value{cedilha}@~oes e recuperar informa@value{cedilha}@~ao.
Os factos nesses contextos n@~ao s@~ao listadas atrav@'es de @code{facts ()}.

A vari@'avel @code{activecontexts} @'e a lista
de contextos que est@~ao activos pelo caminho da fun@value{cedilha}@~ao @code{activate}.

@end deffn

@defvr {Vari@'avel de sistema} activecontexts
Valor por omiss@~ao: @code{[]}

@code{activecontexts} @'e a lista de contextos que est@~ao activos
pelo caminho da fun@value{cedilha}@~ao @code{activate}, em oposi@value{cedilha}@~ao a sendo activo porque
eles s@~ao subcontextos do contexto corrente.

@end defvr

@deffn {Fun@value{cedilha}@~ao} assume (@var{pred_1}, ..., @var{pred_n})
Adiciona predicados @var{pred_1}, ..., @var{pred_n} ao contexto corrente.
Se um predicado for incossistente ou redundante 
com os predicados no contexto corrente,
esses predicados n@~ao s@~ao adicionados ao contexto.
O contexto acumula predicados de cada chamada a @code{assume}.

@code{assume} retorna uma lista cujos elementos s@~ao os predicados adicionados ao contexto
ou os @'atomos @code{redundant} ou @code{inconsistent} onde for aplic@'avel.

Os predicados @var{pred_1}, ..., @var{pred_n} podem somente ser express@~oes
com os operadores relacionais @code{< <= equal notequal >=} e @code{>}.
Predicados n@~ao podem ser express@~oes de igualdades literais @code{=} ou express@~oes de desigualdades literais @code{#},
nem podem elas serem fun@value{cedilha}@~oes de predicado tais como @code{integerp}.

Predicados combinados da forma @code{@var{pred_1} and ... and @var{pred_n}}
s@~ao reconhecidos,
mas n@~ao @code{@var{pred_1} or ... or @var{pred_n}}.
@code{not @var{pred_k}} @'e reconhecidos se @var{pred_k} for um predicado relacional.
Express@~oes da forma @code{not (@var{pred_1} e @var{pred_2})}
and @code{not (@var{pred_1} or @var{pred_2})}
n@~ao s@~ao reconhecidas.

O mecanismo de dedu@value{cedilha}@~ao do Maxima n@~ao @'e muito forte;
exitem consequ@^encias muito @'obvias as quais n@~ao podem ser determinadas por meio de @code{is}.
Isso @'e uma fraqueza conhecida.

@code{assume} avalia seus argumentos.

Veja tamb@'em @code{is}, @code{facts}, @code{forget}, @code{context}, e @code{declare}.

Exemplos:

@c ===beg===
@c assume (xx > 0, yy < -1, zz >= 0);
@c assume (aa < bb and bb < cc);
@c facts ();
@c is (xx > yy);
@c is (yy < -yy);
@c is (sinh (bb - aa) > 0);
@c forget (bb > aa);
@c prederror : false;
@c is (sinh (bb - aa) > 0);
@c is (bb^2 < cc^2);
@c ===end===

@example
(%i1) assume (xx > 0, yy < -1, zz >= 0);
(%o1)              [xx > 0, yy < - 1, zz >= 0]
(%i2) assume (aa < bb and bb < cc);
(%o2)                  [bb > aa, cc > bb]
(%i3) facts ();
(%o3)     [xx > 0, - 1 > yy, zz >= 0, bb > aa, cc > bb]
(%i4) is (xx > yy);
(%o4)                         true
(%i5) is (yy < -yy);
(%o5)                         true
(%i6) is (sinh (bb - aa) > 0);
(%o6)                         true
(%i7) forget (bb > aa);
(%o7)                       [bb > aa]
(%i8) prederror : false;
(%o8)                         false
(%i9) is (sinh (bb - aa) > 0);
(%o9)                        unknown
(%i10) is (bb^2 < cc^2);
(%o10)                       unknown
@end example

@end deffn

@defvr {Vari@'avel de op@value{cedilha}@~ao} assumescalar
Valor por omiss@~ao: @code{true}

@code{assumescalar} ajuda a governar se express@~oes @code{expr}
para as quais @code{nonscalarp (expr)} for @code{false}
s@~ao assumidas comportar-se como escalares
para certas transforma@value{cedilha}@~oes.

Tomemos @code{expr} representando qualquer express@~ao outra que n@~ao uma lista ou uma matriz,
e tomemos @code{[1, 2, 3]} representando qualquer lista ou matriz.
Ent@~ao @code{expr . [1, 2, 3]} retorna @code{[expr, 2 expr, 3 expr]}
se @code{assumescalar} for @code{true}, ou @code{scalarp (expr)} for
@code{true}, ou @code{constantp (expr)} for @code{true}.

Se @code{assumescalar} for @code{true}, tais
express@~oes ir@~ao comportar-se como escalares somente para operadores
comutativos, mas n@~ao para multiplica@value{cedilha}@~ao n@~ao comutativa @code{.}.

Quando @code{assumescalar} for @code{false}, tais
express@~oes ir@~ao comportar-se como n@~ao escalares.

Quando @code{assumescalar} for @code{all},
tais express@~oes ir@~ao comportar-se como escalares para todos os operadores listados
acima.

@end defvr


@defvr {Vari@'avel de op@value{cedilha}@~ao} assume_pos
Valor por omiss@~ao: @code{false}

Quando @code{assume_pos} for @code{true}
e o sinal de um par@^ametro @var{x} n@~ao pode ser determinado a partir do contexto corrente
ou outras considera@value{cedilha}@~oes,
@code{sign} e @code{asksign (@var{x})} retornam @code{true}.
Isso pode impedir algum questionamento de @code{asksign} gerado automaticamente,
tal como pode surgir de @code{integrate} ou de outros c@'alculos.

Por padr@~ao, um par@^ametro @'e @var{x} tal como @code{symbolp (@var{x})}
or @code{subvarp (@var{x})}.
A classe de express@~oes consideradas par@^ametros pode ser modificada para alguma abrang@^encia
atrav@'es da vari@'avel @code{assume_pos_pred}.

@code{sign} e @code{asksign} tentam deduzir o sinal de express@~oes
a partir de sinais de operandos dentro da express@~ao.
Por exemplo, se @code{a} e @code{b} s@~ao ambos positivos,
ent@~ao @code{a + b} @'e tamb@'em positivo.

Todavia, n@~ao existe caminho para desviar todos os questionamentos de @code{asksign}.
Particularmente, quando o argumento de @code{asksign} for uma
diferen@value{cedilha}a @code{@var{x} - @var{y}} ou um logaritmo @code{log(@var{x})},
@code{asksign} sempre solicita uma entrada ao utilizador,
mesmo quando @code{assume_pos} for @code{true} e @code{assume_pos_pred} for
uma fun@value{cedilha}@~ao que retorna @code{true} para todos os argumentos.

@c NEED EXAMPLES HERE
@end defvr


@defvr {Vari@'avel de op@value{cedilha}@~ao} assume_pos_pred
Valor por omiss@~ao: @code{false}

Quando @code{assume_pos_pred} for atribu@'{@dotless{i}}do o nome de uma fun@value{cedilha}@~ao
ou uma express@~ao lambda de um argumento @var{x},
aquela fun@value{cedilha}@~ao @'e chamada para determinar
se @var{x} @'e considerado um par@^ametro para o prop@'osito de @code{assume_pos}.
@code{assume_pos_pred} @'e ignorado quando @code{assume_pos} for @code{false}.

A fun@value{cedilha}@~ao @code{assume_pos_pred} @'e chamada atrav@'es de @code{sign} e de @code{asksign}
com um argumento @var{x}
que @'e ou um @'atomo, uma vari@'avel subscrita, ou uma express@~ao de chamada de fun@value{cedilha}@~ao.
Se a fun@value{cedilha}@~ao @code{assume_pos_pred} retorna @code{true},
@var{x} @'e considerado um par@^ametro para o prop@'osito de @code{assume_pos}.

Por padr@~ao, um par@^ametro @'e @var{x} tal que @code{symbolp (x)} ou @code{subvarp (x)}.

Veja tamb@'em @code{assume} e @code{assume_pos}.

Exemplos:
@c EXAMPLE OUTPUT GENERATED FROM:
@c assume_pos: true$
@c assume_pos_pred: symbolp$
@c sign (a);
@c sign (a[1]);
@c assume_pos_pred: lambda ([x], display (x), true)$
@c asksign (a);
@c asksign (a[1]);
@c asksign (foo (a));
@c asksign (foo (a) + bar (b));
@c asksign (log (a));
@c asksign (a - b);

@example
(%i1) assume_pos: true$
(%i2) assume_pos_pred: symbolp$
(%i3) sign (a);
(%o3)                          pos
(%i4) sign (a[1]);
(%o4)                          pnz
(%i5) assume_pos_pred: lambda ([x], display (x), true)$
(%i6) asksign (a);
                              x = a

(%o6)                          pos
(%i7) asksign (a[1]);
                             x = a
                                  1

(%o7)                          pos
(%i8) asksign (foo (a));
                           x = foo(a)

(%o8)                          pos
(%i9) asksign (foo (a) + bar (b));
                           x = foo(a)

                           x = bar(b)

(%o9)                          pos
(%i10) asksign (log (a));
                              x = a

Is  a - 1  positive, negative, or zero?

p;
(%o10)                         pos
(%i11) asksign (a - b);
                              x = a

                              x = b

                              x = a

                              x = b

Is  b - a  positive, negative, or zero?

p;
(%o11)                         neg
@end example

@end defvr


@defvr {Vari@'avel de op@value{cedilha}@~ao} context
Valor por omiss@~ao: @code{initial}

@code{context} nomeia a colec@,{c}@~ao de factos mantida atrav@'es de @code{assume} e @code{forget}.
@code{assume} adiciona factos @`a colec@,{c}@~ao nomeada atrav@'es de @code{context},
enquanto @code{forget} remove factos.

Associando @code{context} para um nome @var{foo} altera o contexto corrente para @var{foo}.
Se o contexto especificado @var{foo} n@~ao existe ainda,
ele @'e criado automaticamente atrav@'es de uma chamada a @code{newcontext}.
@c ISN'T THIS NEXT BIT EQUIVALENT TO THE FIRST ??
O contexto especificado @'e activado automaticamente.

Veja @code{contexts} para uma descri@value{cedilha}@~ao geral do mecanismo de contexto.

@end defvr

@c UMM, I'M HAVING TROUBLE GETTING THE CONTEXT-SWITCHING STUFF TO BEHAVE AS EXPECTED
@c SOME EXAMPLES WILL HELP A LOT HERE
@defvr {Vari@'avel de op@value{cedilha}@~ao} contexts
Valor por omiss@~ao: @code{[initial, global]}

@code{contexts} @'e uma lista dos contextos que
existem actualmente, incluindo o contexto activo actualmente.

O mecanismo de contexto torna poss@'{@dotless{i}}vel para um utilizador associar
e nomear uma por@value{cedilha}@~ao seleccionada de factos, chamada um contexto.
Assim que isso for conclu@'{@dotless{i}}do, o utilizador pode ter o Maxima assumindo ou esquecendo grande quantidade
de factos meramente atrav@'es da activa@value{cedilha}@~ao ou desativa@value{cedilha}@~ao seu contexto.

Qualquer @'atomo simb@'olico pode ser um contexto, e os factos contidos naquele
contexto ir@~ao ser retidos em armazenamento at@'e que sejam destru@'{@dotless{i}}dos um por um
atrav@'es de chamadas a @code{forget} ou destru@'{@dotless{i}}dos com um conjunto atrav@'es de uma chamada a @code{kill}
para destruir o contexto que eles pertencem.

Contextos existem em uma hierarqu@'{@dotless{i}}a, com o ra@'{@dotless{i}}z sempre sendo
o contexto @code{global}, que cont@'em informa@value{cedilha}@~oes sobre Maxima que alguma
fun@value{cedilha}@~ao precisa.  Quando em um contexto dado, todos os factos naquele
contexto est@~ao "ativos" (significando que eles s@~ao usados em dedu@value{cedilha}@~oes e
recuperados) como est@~ao tamb@'em todos os factos em qualquer contexto que for um subcontexto
do contexto activo.

Quando um novo Maxima for iniciado, o utilizador est@'a em um
contexto chamado @code{initial}, que tem @code{global} como um subcontexto.

Veja tamb@'em @code{facts}, @code{newcontext},
@code{supcontext}, @code{killcontext}, @code{activate}, @code{deactivate}, @code{assume}, e @code{forget}.

@end defvr

@deffn {Fun@value{cedilha}@~ao} deactivate (@var{context_1}, ..., @var{context_n})
Desativa os contextos especificados @var{context_1}, ..., @var{context_n}.

@end deffn

@deffn {Fun@value{cedilha}@~ao} facts (@var{item})
@deffnx {Fun@value{cedilha}@~ao} facts ()
Se @var{item} for o nome de um contexto,
@code{facts (@var{item})} retorna uma lista
de factos no contexto especificado.

Se @var{item} n@~ao for o nome de um contexto,
@code{facts (@var{item})} retorna uma lista de factos conhecidos sobre @var{item} no contexto
actual.  Fatos que est@~ao atuvos, mas em um diferente contexto, n@~ao s@~ao listados.

@code{facts ()} (i.e., sem argumento) lista o contexto actual.

@end deffn

@defvr {Declara@value{cedilha}@~ao} features
Maxima recnhece ceertas propriedades matem@'aticas de fun@value{cedilha}@~oes e vari@'aveis.
Essas s@~ao chamadas "recursos".

@code{declare (@var{x}, @var{foo})} fornece a propriedade @var{foo} para a fun@value{cedilha}@~ao ou vari@'avel @var{x}.

@code{declare (@var{foo}, recurso)} declara um novo recurso @var{foo}.
Por exemplo,
@code{declare ([red, green, blue], feature)}
declara tr@^es novos recursos, @code{red}, @code{green}, e @code{blue}.

O predicado @code{featurep (@var{x}, @var{foo})}
retorna @code{true} se @var{x} possui a propriedade @var{foo},
e @code{false} de outra forma.

A infolista @code{features} @'e uma lista de recursos conhecidos.
S@~ao esses
@code{integer}, @code{noninteger}, @code{even}, @code{odd}, @code{rational},
@code{irrational}, @code{real}, @code{imaginary}, @code{complex},
@code{analytic}, @code{increasing}, @code{decreasing}, @code{oddfun},
@code{evenfun}, @code{posfun}, @code{commutative}, @code{lassociative},
@code{rassociative}, @code{symmetric}, e @code{antisymmetric},
mais quaisquer recursos definidos pelo utilizador.

@code{features} @'e uma lista de recursos matem@'aticos.
Existe tamb@'em uma lista de recursos n@~ao matem@'aticos, recursos dependentes do sistema. Veja @code{status}.

@end defvr

@deffn {Fun@value{cedilha}@~ao} forget (@var{pred_1}, ..., @var{pred_n})
@deffnx {Fun@value{cedilha}@~ao} forget (@var{L})
Remove predicados estabelecidos atrav@'es de @code{assume}.
Os predicados podem ser express@~oes equivalentes a (mas n@~ao necess@'ariamente id@^enticas a)
esses prevamentes assumidos.

@code{forget (@var{L})}, onde @var{L} @'e uma lista de predicados,
esquece cada item da lista.

@end deffn

@deffn {Fun@value{cedilha}@~ao} killcontext (@var{context_1}, ..., @var{context_n})
Mata os contextos @var{context_1}, ..., @var{context_n}.

Se um dos contextos estiver for o contexto actual, o novo contexto
actual ir@'a tornar-se o primeiro subcontexto dispon@'{@dotless{i}}vel do contexto
actual que n@~ao tiver sido morto.  Se o primeiro contexto dispon@'{@dotless{i}}vel
n@~ao morto for @code{global} ent@~ao @code{initial} @'e usado em seu lugar.  Se o contexto
@code{initial} for morto, um novo, por@'em vazio contexto @code{initial} @'e criado.

@code{killcontext} recusa-se a matar um contexto que estiver
ativo actualmente, ou porque ele @'e um subcontexto do contexto
actual, ou atrav@'es do uso da fun@value{cedilha}@~ao @code{activate}.

@code{killcontext} avalia seus argumentos.
@code{killcontext} retorna @code{done}.

@end deffn

@deffn {Fun@value{cedilha}@~ao} newcontext (@var{nome})
Cria um novo contexto, por@'em vazio, chamado @var{nome}, que
tem @code{global} como seu @'unico subcontexto.  O contexto recentemente criado
torna-se o contexto activo actualmente.

@code{newcontext} avalia seu argumento.
@code{newcontext} retorna @var{nome}.

@end deffn

@deffn {Fun@value{cedilha}@~ao} supcontext (@var{nome}, @var{context})
@deffnx {Fun@value{cedilha}@~ao} supcontext (@var{nome})
Cria um novo contexto, chamado @var{nome},
que tem @var{context} como um subcontexto.
@var{context} deve existir.

Se @var{context} n@~ao for especificado, o contexto actual @'e assumido.

@end deffn
