@c /unit.texi/1.2/Sun May 28 17:08:50 2006//
@menu
* Introdu@value{cedilha}@~ao a Units::       
* Defini@value{cedilha}@~oes para Units::       
@end menu

@node Introdu@value{cedilha}@~ao a Units, Defini@value{cedilha}@~oes para Units, unit, unit
@section Introdu@value{cedilha}@~ao a Units

O pacote @emph{unit} torna o utilizador apto a converter entre unidades
arbitr@'arias e trabalhar com dimens@~oes em equa@value{cedilha}@~oes. O funcionamento desse pacote
@'e radicalmente diferente do pacote original units do Maxima - apesar de
o original conter uma lista b@'asica de defini@value{cedilha}@~oes, o pacote actual usa um conjunto de regras para permitir
ao utilizador escolher, sobre uma base dimensional, qual a resposta fianl de unidade pode ser
convertida.  Isso ir@'a separar unidades em lugar de mistur@'a-las na tela,
permitindo ao utilizador durante a leitura identificar as unidades associadas com uma resposta em
particular.  Isso permitir@'a ao utilizador simplificar uma express@~ao em sua Base fundamental
de Unidades, bem como fornecer ajuste fino sobre a simplifica@value{cedilha}@~ao de unidades derivadas.
An@'alise dimensional @'e poss@'{@dotless{i}}vel, e uma variedade de ferramentas est@'a dispon@'{@dotless{i}}vel para 
gerenciar a convers@~ao e tamb@'em uma variedade de op@value{cedilha}@~oes de simplifica@value{cedilha}@~ao. Adicionalmente para personalizar
convers@~ao autom@'atica, @emph{units} tamb@'em fornede um manual tradicional 
de op@value{cedilha}@~oes de convers@~ao.  

Nota -quando convers@~oes de unidade forem n@~ao exactas Maxima ir@'a fazer aproxima@value{cedilha}@~oes resultando 
em fra@value{cedilha}@~oes. Esso @'e uma concequ@^encia das t@'ecnicas usadas para simplificar unidades.
A mensagem de alerta desse tipo de substitui@value{cedilha}@~ao est@'a desabilitada por padr@~ao no
caso de inidades (normalmente essas mensagens est@~ao habilitadas) uma vez que essa situa@value{cedilha}@~ao de iemiss@~ao de mensagens de alerta ocorre frequ@^entemente
e os alertas confundem a sa@'{@dotless{i}}da.  (O estado actual de @code{ratprint} @'e restabelecido
ap@'os uma convers@~ao de unidades, de forma que modifica@value{cedilha}@~oes de utilizador para aquela configura@value{cedilha}@~ao ir@~ao ser preservadas 
de outra forma.)  Se o utilizador precisar dessa informa@value{cedilha}@~ao para @code{units}, ele pode escolher
@emph{unitverbose:on} para reativar a impress@~ao de mensagens de alerta do
processo de convers@~ao.

@emph{unit} est@'a incl@'{@dotless{i}}do no Maxima no direct@'orio share/contrib/unit directory. Isso segue
aos pacotes normais do Maxima conforme conven@value{cedilha}@~oes:

@example
(%i1) load("unit")$
******************************************************************* 
*                       Units version 0.50                        * 
*          Definitions based on the NIST Reference on             * 
*              Constants, Units, and Uncertainty                  * 
*       Conversion factors from various sources including         * 
*                   NIST and the GNU units package                * 
******************************************************************* 
 
Redefining necessary functions... 
WARNING: DEFUN/DEFMACRO: redefining function TOPLEVEL-MACSYMA-EVAL ...
WARNING: DEFUN/DEFMACRO: redefining function MSETCHK ...
WARNING: DEFUN/DEFMACRO: redefining function KILL1 ...
WARNING: DEFUN/DEFMACRO: redefining function NFORMAT ...
Initializing unit arrays... 
Done.
@end example

As mensagens WARNING (DE ALERTA) s@~ao esperadas n @~ao uma causa de preocupa@value{cedilha}@~ao - elas indicam
que o pacote @emph{unit} est@'a redefinindo fun@value{cedilha}@~oes anteriormente definidas no local adequado do Maxima.  
Essa redefini@value{cedilha}@~ao @'e necess@'aria com o bojetivo de manusear adequadamente as unidades.  O utilizador
pode estar consciente que se outras modifica@value{cedilha}@~oes tiverem sido feitas para essas fun@value{cedilha}@~oes por outros
pacotes essas novas mudan@value{cedilha}as ir@~ao ser sobrescritas por meio desse processo de disponibiliza@value{cedilha}@~ao do pacote @code{unit}.

O ficheiro @emph{unit.mac} tamb@'em chama um ficheiro lisp, a saber @emph{unit-functions.lisp}, que
cont@'em as fun@value{cedilha}@~aoes lisp necess@'arias ao pacote.

Clifford Yapp @'e o autor prim@'ario.  Ele recebeu grande contribui@value{cedilha}@~ao de
Barton Willis da University of Nebraska at Kearney (UNK), Robert Dodier, e
da intr@'epida tribo da lista de mensagens do Maxima.

Existem provavelmente muitos erros.  Diga-me quais.  @code{float} e @code{numer}
n@~ao fazem o que @'e esperado.

PORFAZER : funcionalidade de dimens@~ao, manuseio de temperatura, 
a fun@value{cedilha}@~ao @code{showabbr} e Cia. Ltda.  Mostrar exemplos com adi@value{cedilha}@~ao de quantidades contendo
unidades.


@node Defini@value{cedilha}@~oes para Units,  , Introdu@value{cedilha}@~ao a Units, unit
@section Defini@value{cedilha}@~oes para Units

@deffn {Fun@value{cedilha}@~ao} setunits (@var{list})
Por padr@~ao, o pacote @emph{unit} n@~ao usa qualquer dimens@~oes derivadas, mas ir@'a
converter todas as unidades nas sete fundamentais do sistema MKS.
@example
(%i2) N;
                                     kg m
(%o2)                                ----
                                       2
                                      s
(%i3) dyn;
                                   1      kg m
(%o3)                           (------) (----)
                                 100000     2
                                           s
(%i4) g;
                                    1
(%o4)                             (----) (kg)
                                   1000
(%i5) centigram*inch/minutes^2;
                                  127        kg m
(%o5)                       (-------------) (----)
                             1800000000000     2
                                              s
@end example

Em alguns casos esse @'e o comportamento desejado.  Se o utilizador desejar usar outras
unidades, isso @'e conseguido com o comando @code{setunits}:
@example
(%i6) setunits([centigram,inch,minute]);
(%o6)                                done
(%i7) N;
                            1800000000000   %in cg
(%o7)                      (-------------) (------)
                                 127            2
                                            %min
(%i8) dyn;
                               18000000   %in cg
(%o8)                         (--------) (------)
                                 127          2
                                          %min
(%i9) g;
(%o9)                             (100) (cg)
(%i10) centigram*inch/minutes^2;
                                    %in cg
(%o10)                              ------
                                        2
                                    %min
@end example

A escolha de unidades @'e completamente flex@'{@dotless{i}}vel.  Por exemplo, se quisermos
voltar para quiilogramas, metros, e segundos como padr@~ao para essas
dimens@~ao n@'os podemos fazer:
@example
(%i11) setunits([kg,m,s]);
(%o11)                               done
(%i12) centigram*inch/minutes^2;
                                  127        kg m
(%o12)                      (-------------) (----)
                             1800000000000     2
                                              s
@end example

Unidade derivadas s@~ao tamb@'em manuse@'aveis por meio desse comando:
@example
(%i17) setunits(N);
(%o17)                               done
(%i18) N;
(%o18)                                 N
(%i19) dyn; 
                                    1
(%o19)                           (------) (N)
                                  100000
(%i20) kg*m/s^2;
(%o20)                                 N
(%i21) centigram*inch/minutes^2;
                                    127
(%o21)                        (-------------) (N)
                               1800000000000
@end example

Note que o pacote @emph{unit} reconhece a combina@value{cedilha}@~ao n@~ao MKS
de massa, comprimento, e tempo inverso elevado ao quadrado como uma for@value{cedilha}a, e converte isso
para Newtons.  @'E dessa forma que Maxima trabalha geralmente.  Se, por exemplo, n@'os
preferirmos dinas em lugar de Newtons, simplesmente fazemos o seguinte:
@example
(%i22) setunits(dyn);
(%o22)                               done
(%i23) kg*m/s^2;
(%o23)                          (100000) (dyn)
(%i24) centigram*inch/minutes^2;
                                  127
(%o24)                         (--------) (dyn)
                                18000000
@end example

Para descontinuar simplificando para qualquer unidade de for@value{cedilha}a, usamos o comando @code{uforget}:
@example
(%i26) uforget(dyn);
(%o26)                               false
(%i27) kg*m/s^2;
                                     kg m
(%o27)                               ----
                                       2
                                      s
(%i28) centigram*inch/minutes^2;
                                  127        kg m
(%o28)                      (-------------) (----)
                             1800000000000     2
                                              s
@end example
Isso pode trabalhar igualmente bem com @code{uforget(N)} ou
@code{uforget(%force)}.

Veja tamb@'em @code{uforget}. Para usar essa fun@value{cedilha}@~ao escreva primeiro @code{load("unit")}.
@end deffn

@deffn {Fun@value{cedilha}@~ao} uforget (@var{list})
Por padr@~ao, o pacote @emph{unit} converte todas as unidades para as
sete unidaes fundamentais do sitema MKS de unidades. Ess comportamento pode
ser mudado com o comando @code{setunits}. Ap@'os o qual, o
utilizador pode restabelecer o comportamento padr@~ao para uma dimens@~ao em particular
mediante o comando @code{uforget}:
@example
(%i13) setunits([centigram,inch,minute]);
(%o13)                               done
(%i14) centigram*inch/minutes^2;
                                    %in cg
(%o14)                              ------
                                        2
                                    %min
(%i15) uforget([cg,%in,%min]);
(%o15)                      [false, false, false]
(%i16) centigram*inch/minutes^2;
                                  127        kg m
(%o16)                      (-------------) (----)
                             1800000000000     2
                                              s
@end example

@code{uforget} opera sobre dimens@~oes,
n@~ao sobre unidades, de forma que qualquer unidade de uma dimens@~ao em particular ir@'a trabalhar.  A
pr@'opia dimens@~ao @'e tamb@'em um argumento legal.

Veja tamb@'em @code{setunits}. To use this function write first @code{load("unit")}.
@end deffn

@deffn {Fun@value{cedilha}@~ao} convert (@var{expr}, @var{list})
Quando do restabelecimento dos valores padr@~ao o ambiente global @'e destru@'{@dotless{i}}do, existe o comando
@code{convert}, que permite convers@~oes imediatas.  @code{convert} pode aceitar  um argumetno
simples ou uma lista de unidades a serem usadas na convers@~ao.  Quando uma opera@value{cedilha}@~ao de convers@~ao for
conclu@'{@dotless{i}}da, o sistema normal de avalia@value{cedilha}@~ao global @'e contornado, com o objectivo de evitar que
o resultado desejado seja convertido novamente.  Como consequ@^encia, em c@'alculos aproximados
alertas de "rat" ir@~ao ser vis@'{@dotless{i}}veis se o ambiente global que controla esse comportamento
(@code{ratprint}) for @code{true}.  @code{convert} tamb@'em @'e @'util para uma verifica@value{cedilha}@~ao pontual e imediata da
precis@~ao de uma convers@~ao global.  Outro recurso @'e que @code{convert} ir@'a permitir a um
utilizador fazer um Base de Convers@~oes Dimensionais mesmo se o ambiente global for escolhido para
simplificar par uma Dimens@~ao Derivada.

@example
(%i2) kg*m/s^2;
                                     kg m
(%o2)                                ----
                                       2
                                      s
(%i3) convert(kg*m/s^2,[g,km,s]);
                                     g km
(%o3)                                ----
                                       2
                                      s
(%i4) convert(kg*m/s^2,[g,inch,minute]);

`rat' replaced 39.37007874015748 by 5000/127 = 39.37007874015748
                              18000000000   %in g
(%o4)                        (-----------) (-----)
                                  127           2
                                            %min
(%i5) convert(kg*m/s^2,[N]);
(%o5)                                  N
(%i6) convert(kg*m^2/s^2,[N]);
(%o6)                                 m N
(%i7) setunits([N,J]);
(%o7)                                done
(%i8) convert(kg*m^2/s^2,[N]);
(%o8)                                 m N
(%i9) convert(kg*m^2/s^2,[N,inch]);

`rat' replaced 39.37007874015748 by 5000/127 = 39.37007874015748
                                 5000
(%o9)                           (----) (%in N)
                                 127
(%i10) convert(kg*m^2/s^2,[J]);
(%o10)                                 J
(%i11) kg*m^2/s^2;
(%o11)                                 J
(%i12) setunits([g,inch,s]);
(%o12)                               done
(%i13) kg*m/s^2;
(%o13)                                 N
(%i14) uforget(N);
(%o14)                               false
(%i15) kg*m/s^2;
                                5000000   %in g
(%o15)                         (-------) (-----)
                                  127       2
                                           s
(%i16) convert(kg*m/s^2,[g,inch,s]);

`rat' replaced 39.37007874015748 by 5000/127 = 39.37007874015748
                                5000000   %in g
(%o16)                         (-------) (-----)
                                  127       2
                                           s
@end example

Veja tamb@'em @code{setunits} e @code{uforget}. Para usar essa fun@value{cedilha}@~ao primeiramente escreva @code{load("unit")}.
@end deffn


@defvr {Vari@'avel de op@value{cedilha}@~ao} usersetunits
Valor por omiss@~ao: none

Se um utilizador desejar ter um comportamento padr@~ao de unidade diferente daquele descrito,
ele pode fazer uso de @emph{maxima-init.mac} e da vari@'avel
@emph{usersetunits}.  O pacote @emph{unit} ir@'a verificar o ficheiro @emph{maxima-init.mac} na inicializa@value{cedilha}@~ao para ver se a essa vari@'avel 
foi atribu@'{@dotless{i}}do uma lista.  Se isso aconteceu, o pacote @emph{unit} ir@'a usar @code{setunits} sobre aquela lista e pegar 
as unidades l@'a colocadas para serem as padr@~oes.  @code{uforget} ir@'a reverter para o comportamento
definido por @code{usersetunits} sobrescrevendo seus pr@'oprios padr@~oes.  Por exemplo, Se tivermos um ficheiro
@emph{maxima-init.mac} contendo:
@example
usersetunits : [N,J];
@end example
n@'os poderemos ver o seguinte comportamento:
@example
(%i1) load("unit")$
******************************************************************* 
*                       Units version 0.50                        * 
*          Definitions based on the NIST Reference on             * 
*              Constants, Units, and Uncertainty                  * 
*       Conversion factors from various sources including         * 
*                   NIST and the GNU units package                * 
******************************************************************* 
 
Redefining necessary functions... 
WARNING: DEFUN/DEFMACRO: redefining function TOPLEVEL-MACSYMA-EVAL ...
WARNING: DEFUN/DEFMACRO: redefining function MSETCHK ...
WARNING: DEFUN/DEFMACRO: redefining function KILL1 ...
WARNING: DEFUN/DEFMACRO: redefining function NFORMAT ...
Initializing unit arrays... 
Done. 
User defaults found... 
User defaults initialized.
(%i2) kg*m/s^2;
(%o2)                                  N
(%i3) kg*m^2/s^2;
(%o3)                                  J
(%i4) kg*m^3/s^2;
(%o4)                                 J m
(%i5) kg*m*km/s^2;
(%o5)                             (1000) (J)
(%i6) setunits([dyn,eV]);
(%o6)                                done
(%i7) kg*m/s^2;
(%o7)                           (100000) (dyn)
(%i8) kg*m^2/s^2;
(%o8)                     (6241509596477042688) (eV)
(%i9) kg*m^3/s^2;
(%o9)                    (6241509596477042688) (eV m)
(%i10) kg*m*km/s^2;
(%o10)                   (6241509596477042688000) (eV)
(%i11) uforget([dyn,eV]);  
(%o11)                           [false, false]
(%i12) kg*m/s^2;
(%o12)                                 N
(%i13) kg*m^2/s^2;
(%o13)                                 J
(%i14) kg*m^3/s^2;
(%o14)                                J m
(%i15) kg*m*km/s^2;
(%o15)                            (1000) (J)
@end example
Sem @code{usersetunits}, as entradas iniciais poderiam ter sido convertidas
para o sistema de unidades MKS, e @code{uforget} poderia ter resultado em um retorno para as regras do MKS.  Em vez disso,
as prefer@^encias do utilizador foram respeitadas em ambos os casos.  Note que esse podem ainda
serem sobrescritos se for desejado.  Para eliminar completamente essa simplifica@value{cedilha}@~ao - i.e.
ter as prefer@^encias de utilizador escolhidas para os padr@~oes de unidade do Maxima - o comando
@code{dontusedimension} pode ser usado.  @code{uforget} pode restabelecer as prefer@^encias de utilizador novamente, mas
somente se @code{usedimension} liberar isso para uso.  Alternativamente,
@code{kill(usersetunits)} ir@'a remover completametne todo o conhecimento dessas escolhas de utilizador
da sess@~ao actual.  Aqui est@'a alguns exemplos de como esssas v@'arias op@value{cedilha}@~oes trabalham.
@example
(%i2) kg*m/s^2;
(%o2)                                  N
(%i3) kg*m^2/s^2;
(%o3)                                  J
(%i4) setunits([dyn,eV]);
(%o4)                                done
(%i5) kg*m/s^2;
(%o5)                           (100000) (dyn)
(%i6) kg*m^2/s^2;
(%o6)                     (6241509596477042688) (eV)
(%i7) uforget([dyn,eV]);
(%o7)                          [false, false]
(%i8) kg*m/s^2;
(%o8)                                  N
(%i9) kg*m^2/s^2;
(%o9)                                  J
(%i10) dontusedimension(N);
(%o10)                             [%force]
(%i11) dontusedimension(J);
(%o11)                         [%energy, %force]
(%i12) kg*m/s^2;
                                     kg m
(%o12)                               ----
                                       2
                                      s
(%i13) kg*m^2/s^2;
                                         2
                                     kg m
(%o13)                               -----
                                       2
                                      s
(%i14) setunits([dyn,eV]);
(%o14)                               done
(%i15) kg*m/s^2;
                                     kg m
(%o15)                               ----
                                       2
                                      s
(%i16) kg*m^2/s^2;
                                         2
                                     kg m
(%o16)                               -----
                                       2
                                      s
(%i17) uforget([dyn,eV]);
(%o17)                         [false, false]
(%i18) kg*m/s^2;
                                     kg m
(%o18)                               ----
                                       2
                                      s
(%i19) kg*m^2/s^2;
                                         2
                                     kg m
(%o19)                               -----
                                       2
                                      s
(%i20) usedimension(N);
Done.  To have Maxima simplify to this dimension, use setunits([unit]) 
to select a unit. 
(%o20)                               true
(%i21) usedimension(J);
Done.  To have Maxima simplify to this dimension, use setunits([unit]) 
to select a unit. 
(%o21)                               true
(%i22) kg*m/s^2;
                                     kg m
(%o22)                               ----
                                       2
                                      s
(%i23) kg*m^2/s^2;
                                         2
                                     kg m
(%o23)                               -----
                                       2
                                      s
(%i24) setunits([dyn,eV]);
(%o24)                               done
(%i25) kg*m/s^2;
(%o25)                          (100000) (dyn)
(%i26) kg*m^2/s^2;
(%o26)                    (6241509596477042688) (eV)
(%i27) uforget([dyn,eV]);
(%o27)                           [false, false]
(%i28) kg*m/s^2;
(%o28)                                 N
(%i29) kg*m^2/s^2;
(%o29)                                 J
(%i30) kill(usersetunits);
(%o30)                               done
(%i31) uforget([dyn,eV]);
(%o31)                          [false, false]
(%i32) kg*m/s^2;
                                     kg m
(%o32)                               ----
                                       2
                                      s
(%i33) kg*m^2/s^2;
                                         2
                                     kg m
(%o33)                               -----
                                       2
                                      s
@end example
Desafortunadamente essa ampla variedade de op@value{cedilha}@~oes @'e um pouco confus no in@'{@dotless{i}}cio,
mas uma vez que o utilizador cultiva o uso delas o utilizador perceber@'a que elas permitem completo
controle sobre seu ambiente de trabalho.

@c One other significant customization option available is the @code{setunitprefix}
@c command.  Normally, abbreviations used in this package are as close to those
@c used in standard texts as possible.  Some people, however, prefer to use those
@c symbols for normal work and have units labeled in some other fasion. 
@c @code{setunitprefix} is provided for this case.  Here is an example of its use:

@end defvr


@deffn {Fun@value{cedilha}@~ao} metricexpandall (@var{x})
Reconstr@'oi listas de unidades globais automaticamente criando todas as unidades m@'etricas desejadas.
@var{x} @'e um argumento num@'erico que @'e usado para especificar quantos prefixos
m@'etricos o utilizador deseja que seja definido.  Os argumentos s@~ao os seguintes, com cada
maior n@'umero definindo todos os menores n@'umeros de unidade:
@example
           0 - none. Only base units
           1 - kilo, centi, milli
(default)  2 - giga, mega, kilo, hecto, deka, deci, centi, milli,
               micro, nano
           3 - peta, tera, giga, mega, kilo, hecto, deka, deci,
               centi, milli, micro, nano, pico, femto
           4 - all
@end example
Normalmente, Maxima n@~ao ir@'a definir a expans@~ao completa desses resultados em uma
grande n@'umero de unidades, mas @code{metricexpandall} pode ser usada para
reconstruir a lista em um estilo mais ou menos completo. A vari@'avel relevante
no ficheiro @emph{unit.mac} @'e @var{%unitexpand}.
@c This should be made configurable as a maxima-init.mac controllable option.
@end deffn

@defvr {Vari@'avel} %unitexpand
Valor por omiss@~ao: @code{2}

Ess @'e o valor fornecido a @code{metricexpandall} durante a inicializa@value{cedilha}@~ao
de @emph{unit}.

@end defvr


@c @deffn {Fun@value{cedilha}@~ao} functionname (@var{arg1}, @var{arg2}, ..., @var{argn})
@c @end deffn

@c @defvr {Vari@'avel de op@value{cedilha}@~ao} variablename
@c Default value: @code{true}
@c @end defvr

